Tekla Open API Reference for Tekla Structures 2025
Mesh.Points Property
 An array list of point objects representing the mesh points.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Points { get; }
Public ReadOnly Property Points As ArrayList
	Get
Property Value
Type: ArrayList
See Also
Reference
Mesh Class
Tekla.Structures.Model.UI Namespace